Revit 2026 API
PDFExportOptions Methods
The PDFExportOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetExportInBackground |  Execute PDF export as a background process.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetNamingRule |  Gets a copy of the naming rule.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsValidNamingRule
SetExportInBackground |  Execute PDF export as a background process.
SetNamingRule
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace